app/controllers/movies_controller.rb

    def index
        puts params
        @all_ratings = ['G','PG','PG-13','R']
        @title_ordered = false
        @date_ordered = false
        @ratings_to_show = @all_ratings
        session[:ratings_to_show] = @ratings_to_show
        session[:is_ordered_by_date] = @date_ordered
        session[:is_ordered_by_title] = @title_ordered
        @if_date_chosen = "hilite bg-transparent"
        @if_title_chosen = "hilite bg-transparent"
        session[:home] = false
        # Changed some ratings selection but not all are unchecked
        if (params[:ratings])
            @ratings_to_show = params[:ratings].keys
            @movies = Movie.with_ratings(@ratings_to_show)
            session[:ratings_to_show] = @ratings_to_show
            session[:home] = true
        end
        # Clicked to sort by title
        if (params[:title_ordered])
            @title_ordered = true
            @ratings_to_show = params[:title_ordered].keys
            session[:ratings_to_show] = @ratings_to_show
            session[:is_ordered_by_title] = @title_ordered
            session[:is_ordered_by_date] = false
            @movies = Movie.order(:title).with_ratings(@ratings_to_show)
---
SELECT "movies".* FROM "movies" WHERE (rating IN ('G','PG','PG-13','R'))  ORDER BY "movies"."title" ASC

            session[:ratings_to_show] = @ratings_to_show
            session[:is_ordered_by_date] = @date_ordered
            session[:is_ordered_by_title] = false
            @movies = Movie.order(:release_date).with_ratings(@ratings_to_show)
---
SELECT "movies".* FROM "movies" WHERE (rating IN ('G','PG','PG-13','R'))  ORDER BY "movies"."release_date" ASC